{
    "common": {
        "name": "cloudrain",
        "version": "0.1.3",
        "news": {
            "0.1.3": {
                "en": "irrigation poll intervall is now 10 sec during irrigation and min. 60 sec otherwise\ndependency of request and util lib removed, replaced by got",
                "de": "Beregnungsabfrageintervall beträgt jetzt 10 Sek. während der Beregnung und min. 60 Sek sonst\nAbhängigkeit von request und util lib entfernt, durch got . ersetzt",
                "ru": "Интервал между опросами при поливе теперь составляет 10 секунд во время полива и мин. 60 сек в противном случае\nзависимость запроса и утилит lib удалена, заменена на got",
                "pt": "o intervalo de pesquisa de irrigação é agora de 10 seg durante a irrigação e min. 60 segundos de outra forma\ndependência de solicitação e biblioteca util removida, substituída por obtida",
                "nl": "irrigatie poll interval is nu 10 sec tijdens irrigatie en min. 60 seconden anders\nafhankelijkheid van verzoek en util lib verwijderd, vervangen door got",
                "fr": "l'intervalle de sondage d'irrigation est maintenant de 10 secondes pendant l'irrigation et de min. 60 secondes sinon\ndépendance de request et util lib supprimée, remplacée par got",
                "it": "l'intervallo di polling di irrigazione è ora di 10 secondi durante l'irrigazione e min. 60 sec altrimenti\ndipendenza di request e util lib rimossa, sostituita da got",
                "es": "El intervalo de sondeo de riego es ahora de 10 segundos durante el riego y min. 60 segundos de lo contrario\ndependencia de la solicitud y la lib de utilidad eliminada, reemplazada por got",
                "pl": "Interwał sondowania nawadniania wynosi teraz 10 sekund podczas nawadniania i min. 60 sekund inaczej\nusunięta zależność żądania i biblioteki util, zastąpiona przez got",
                "zh-cn": "灌溉轮询间隔现在是灌溉期间 10 秒和分钟。 60 秒，否则\n删除请求和 util lib 的依赖关系，替换为 got"
            },
            "0.1.2": {
                "en": "Updated installation instructions",
                "de": "Aktualisierte Installationsanweisungen",
                "ru": "Обновленная инструкция по установке",
                "pt": "Instruções de instalação atualizadas",
                "nl": "Bijgewerkte installatie-instructies",
                "fr": "Instructions d'installation mises à jour",
                "it": "Istruzioni di installazione aggiornate",
                "es": "Instrucciones de instalación actualizadas",
                "pl": "Zaktualizowana instrukcja instalacji",
                "zh-cn": "更新安装说明"
            },
            "0.1.1": {
                "en": "irrigation status is updated instantly after execution of an irrigation command\nDebug and Info Log Messages clarified\nInstallation instructions added to README",
                "de": "Beregnungsstatus wird sofort nach Ausführung eines Beregnungsbefehls aktualisiert\nDebug- und Info-Log-Meldungen geklärt\nInstallationsanweisungen zu README hinzugefügt",
                "ru": "статус полива обновляется сразу после выполнения команды полива\nУточнены сообщения журнала отладки и информационного журнала\nИнструкции по установке добавлены в README",
                "pt": "o status da irrigação é atualizado instantaneamente após a execução de um comando de irrigação\nDepuração e mensagens de registro de informações esclarecidas\nInstruções de instalação adicionadas ao README",
                "nl": "irrigatiestatus wordt direct bijgewerkt na uitvoering van een irrigatieopdracht\nFoutopsporings- en infologberichten opgehelderd\nInstallatie-instructies toegevoegd aan README",
                "fr": "l'état de l'irrigation est mis à jour instantanément après l'exécution d'une commande d'irrigation\nMessages de débogage et de journal d'informations clarifiés\nInstructions d'installation ajoutées au fichier README",
                "it": "lo stato dell'irrigazione viene aggiornato immediatamente dopo l'esecuzione di un comando di irrigazione\nMessaggi di log di debug e informazioni chiariti\nIstruzioni di installazione aggiunte a README",
                "es": "El estado del riego se actualiza instantáneamente después de la ejecución de un comando de riego.\nMensajes de registro de información y depuración aclarados\nInstrucciones de instalación agregadas a README",
                "pl": "stan nawadniania jest aktualizowany natychmiast po wykonaniu polecenia nawadniania\nWyjaśnienie komunikatów dziennika debugowania i informacji\nInstrukcja instalacji dodana do README",
                "zh-cn": "灌溉状态在执行灌溉命令后立即更新\n澄清了调试和信息日志消息\n安装说明添加到自述文件"
            },
            "0.0.8": {
                "en": "Updated Documentation",
                "de": "Aktualisierte Dokumentation",
                "ru": "Обновленная документация",
                "pt": "Documentação Atualizada",
                "nl": "Bijgewerkte documentatie",
                "fr": "Documentation mise à jour",
                "it": "Documentazione aggiornata",
                "es": "Documentación actualizada",
                "pl": "Zaktualizowana dokumentacja",
                "zh-cn": "更新文档"
            },
            "0.0.7": {
                "en": "Updated Documentation",
                "de": "Aktualisierte Dokumentation",
                "ru": "Обновленная документация",
                "pt": "Documentação Atualizada",
                "nl": "Bijgewerkte documentatie",
                "fr": "Documentation mise à jour",
                "it": "Documentazione aggiornata",
                "es": "Documentación actualizada",
                "pl": "Zaktualizowana dokumentacja",
                "zh-cn": "更新文档"
            },
            "0.0.6": {
                "en": "->\n\nUpdated Documentation",
                "de": "->\n\nAktualisierte Dokumentation",
                "ru": "->\n\nОбновленная документация",
                "pt": "->\n\nDocumentação Atualizada",
                "nl": "->\n\nBijgewerkte documentatie",
                "fr": "->\n\nDocumentation mise à jour",
                "it": "->\n\nDocumentazione aggiornata",
                "es": "->\n\nDocumentación actualizada",
                "pl": "->\n\nZaktualizowana dokumentacja",
                "zh-cn": "->\n\n更新文档"
            },
            "0.0.5": {
                "en": "Implemented info.connection to indicate valid Cloudrain access token\nRemoved Boilerplate Code and Refactored some Stuff\nImplemented Start / Stop irrigation \nUpdated Documentation\n->",
                "de": "Implementierte info.connection, um ein gültiges Cloudrain-Zugriffstoken anzuzeigen\nBoilerplate-Code entfernt und einige Sachen überarbeitet\nImplementierte Start / Stopp-Bewässerung\nAktualisierte Dokumentation\n->",
                "ru": "Реализован info.connection для указания действительного токена доступа Cloudrain.\nУдален Boilerplate Code и произведен рефакторинг\nРеализован запуск / остановка полива.\nОбновленная документация\n->",
                "pt": "Info.connection implementado para indicar token de acesso válido do Cloudrain\nCódigo de Boilerplate Removido e Refatorado algumas Coisas\nIniciar / parar irrigação implementada\nDocumentação Atualizada\n->",
                "nl": "Info.connection geïmplementeerd om geldige Cloudrain-toegangstoken aan te geven\nBoilerplate-code verwijderd en wat dingen gerefactored\nGeïmplementeerd Start / Stop irrigatie\nBijgewerkte documentatie\n->",
                "fr": "Info.connection implémentée pour indiquer un jeton d'accès Cloudrain valide\nSuppression du code passe-partout et refonte de certaines choses\nMise en œuvre Démarrer / Arrêter l'irrigation\nDocumentation mise à jour\n->",
                "it": "Implementato info.connection per indicare un token di accesso Cloudrain valido\nRimosso il codice boilerplate e rifattorizzato alcune cose\nImplementato Start/Stop irrigazione\nDocumentazione aggiornata\n->",
                "es": "Info.connection implementada para indicar un token de acceso de Cloudrain válido\nSe eliminó el código repetitivo y se refactorizaron algunas cosas\nRiego Start / Stop implementado\nDocumentación actualizada\n->",
                "pl": "Zaimplementowano info.connection wskazujący poprawny token dostępu do Cloudrain\nUsunięto Boilerplate Code i zrefaktorowano niektóre rzeczy\nWdrożone nawadnianie Start / Stop\nZaktualizowana dokumentacja\n->",
                "zh-cn": "实施 info.connection 以指示有效的 Cloudrain 访问令牌\n删除了样板代码并重构了一些东西\n实施启动/停止灌溉\n更新文档\n->"
            },
            "0.0.4": {
                "en": "still npm release script hazzle\n\n-->",
                "de": "immer noch npm release script hazzle\n\n-->",
                "ru": "все еще скрипт выпуска npm\n\n-->",
                "pt": "ainda npm release script hazzle\n\n-->",
                "nl": "still npm release script hazzle\n\n-->",
                "fr": "toujours npm release script hazzle\n\n-->",
                "it": "ancora npm rilascio script hazzle\n\n-->",
                "es": "todavía npm release script hazzle\n\n-->",
                "pl": "nadal blokuje skrypt wydania npm\n\n-->",
                "zh-cn": "仍然 npm 发布脚本令人眼花缭乱\n\n-->"
            },
            "0.0.3": {
                "en": "->",
                "de": "->",
                "ru": "->",
                "pt": "->",
                "nl": "->",
                "fr": "->",
                "it": "->",
                "es": "->",
                "pl": "->",
                "zh-cn": "->"
            },
            "0.0.2": {
                "en": "* initial release\n\n## License\nMIT License\n\nCopyright (c) 2021 hendrikhoffmann <hhoffmann@web.de>\n\nPermission is hereby granted, free of charge, to any person obtaining a copy\nof this software and associated documentation files (the \"Software\"), to deal\nin the Software without restriction, including without limitation the rights\nto use, copy, modify, merge, publish, distribute, sublicense, and/or sell\ncopies of the Software, and to permit persons to whom the Software is\nfurnished to do so, subject to the following conditions:\n\nThe above copyright notice and this permission notice shall be included in all\ncopies or substantial portions of the Software.\n\nTHE SOFTWARE IS PROVIDED \"AS IS\", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR\nIMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,\nFITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE\nAUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER\nLIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,\nOUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE\nSOFTWARE.",
                "de": "* Erstveröffentlichung\n\n## Lizenz\nMIT-Lizenz\n\nCopyright (c) 2021 hendrikhoffmann <hhoffmann@web.de>\n\nDie Erlaubnis wird hiermit jeder Person, die eine Kopie erhält, kostenlos erteilt\ndieser Software und der zugehörigen Dokumentationsdateien (die \"Software\"), um\nan der Software uneingeschränkt, einschließlich und ohne Einschränkung der Rechte\nzu verwenden, kopieren, modifizieren, zusammenführen, veröffentlichen, verteilen, unterlizenzieren und/oder verkaufen\nKopien der Software zu erstellen und Personen, denen die Software zur Verfügung steht,\ndazu unter folgenden Bedingungen bereitgestellt:\n\nDer obige Urheberrechtshinweis und dieser Erlaubnishinweis müssen in allen enthalten sein\nKopien oder wesentliche Teile der Software.\n\nDIE SOFTWARE WIRD \"WIE BESEHEN\", OHNE JEGLICHE GEWÄHRLEISTUNG, AUSDRÜCKLICH ODER\nSTILLSCHWEIGEND, EINSCHLIESSLICH, ABER NICHT BESCHRÄNKT AUF DIE GARANTIEN DER MARKTGÄNGIGKEIT,\nEIGNUNG FÜR EINEN BESTIMMTEN ZWECK UND NICHTVERLETZUNG. IN KEINEM FALL SOLL DAS\nAUTOREN ODER URHEBERRECHTSINHABER HAFTEN FÜR JEGLICHE ANSPRÜCHE, SCHÄDEN ODER ANDERES\nHAFTUNG, OB AUS VERTRAGSHANDELN, UNERLAUBTER ODER ANDERWEITIG, AUS,\nAUSSER ODER IN VERBINDUNG MIT DER SOFTWARE ODER DER NUTZUNG ODER ANDEREN HANDELN IN DER\nSOFTWARE.",
                "ru": "* Первый выпуск\n\n## Лицензия\nЛицензия MIT\n\nАвторские права (c) 2021 hendrikhoffmann <hhoffmann@web.de>\n\nРазрешение предоставляется бесплатно любому лицу, получившему копию.\nэтого программного обеспечения и связанных файлов документации («Программное обеспечение») для работы с\nв Программном обеспечении без ограничений, включая, помимо прочего, права\nиспользовать, копировать, изменять, объединять, публиковать, распространять, сублицензировать и / или продавать\nкопий Программного обеспечения и разрешить лицам, которым Программное обеспечение\nпредоставлены для этого при соблюдении следующих условий:\n\nВышеупомянутое уведомление об авторских правах и это уведомление о разрешении должны быть включены во все\nкопии или существенные части Программного обеспечения.\n\nПРОГРАММНОЕ ОБЕСПЕЧЕНИЕ ПРЕДОСТАВЛЯЕТСЯ «КАК ЕСТЬ», БЕЗ КАКИХ-ЛИБО ГАРАНТИЙ, ЯВНЫХ ИЛИ ЯВНЫХ.\nПОДРАЗУМЕВАЕМЫЕ, ВКЛЮЧАЯ, НО НЕ ОГРАНИЧЕННАЯ, ГАРАНТИИ КОММЕРЧЕСКОЙ ЦЕННОСТИ,\nПРИГОДНОСТЬ ДЛЯ КОНКРЕТНОЙ ЦЕЛИ И ЗАЩИТА ОТ ПРАВ. НИ В КОЕМ СЛУЧАЕ\nАВТОРЫ ИЛИ ДЕРЖАТЕЛИ АВТОРСКИХ ПРАВ НЕСУТ ОТВЕТСТВЕННОСТЬ ЗА ЛЮБЫЕ ПРЕТЕНЗИИ, УБЫТКИ ИЛИ ДРУГИЕ\nОТВЕТСТВЕННОСТЬ, ВЫЯВЛЯЮЩАЯСЯ ЛИ В РЕЗУЛЬТАТЕ ДОГОВОРА, ПРАКТИКИ ИЛИ ИНЫМ ОБРАЗОМ,\nБЕЗ ПРОГРАММНОГО ОБЕСПЕЧЕНИЯ ИЛИ В СВЯЗИ С ПРОГРАММНЫМ ОБЕСПЕЧЕНИЕМ, ИЛИ ИСПОЛЬЗОВАНИЕМ ИЛИ ДРУГИМИ ДЕЛАМИ\nПРОГРАММНОЕ ОБЕСПЕЧЕНИЕ.",
                "pt": "* lançamento inicial\n\n## Licença\nLicença MIT\n\nCopyright (c) 2021 hendrikhoffmann <hhoffmann@web.de>\n\nA permissão é concedida, gratuitamente, a qualquer pessoa que obtenha uma cópia\ndeste software e arquivos de documentação associados (o \"Software\"), para lidar\nno Software sem restrição, incluindo, sem limitação, os direitos\npara usar, copiar, modificar, mesclar, publicar, distribuir, sublicenciar e / ou vender\ncópias do Software, e para permitir que as pessoas a quem o Software é\nfornecido para fazê-lo, sujeito às seguintes condições:\n\nO aviso de direitos autorais acima e este aviso de permissão devem ser incluídos em todos\ncópias ou partes substanciais do Software.\n\nO SOFTWARE É FORNECIDO \"COMO ESTÁ\", SEM GARANTIA DE QUALQUER TIPO, EXPRESSA OU\nIMPLÍCITA, INCLUINDO, MAS NÃO SE LIMITANDO ÀS GARANTIAS DE COMERCIALIZAÇÃO,\nADEQUAÇÃO A UMA FINALIDADE ESPECÍFICA E NÃO VIOLAÇÃO. EM NENHUMA HIPÓTESE O\nAUTORES OU TITULARES DE DIREITOS AUTORAIS SÃO RESPONSÁVEIS POR QUALQUER RECLAMAÇÃO, DANOS OU OUTROS\nRESPONSABILIDADE, SEJA EM AÇÃO DE CONTRATO, DELITO OU DE OUTRA FORMA, DECORRENTE DE,\nFORA DE OU EM CONEXÃO COM O SOFTWARE OU O USO OU OUTRAS NEGOCIAÇÕES NO\nPROGRAMAS.",
                "nl": "* Eerste uitgave\n\n## Vergunning\nMIT-licentie\n\nCopyright (c) 2021 hendrikhoffmann <hhoffmann@web.de>\n\nHierbij wordt gratis toestemming verleend aan eenieder die een exemplaar verkrijgt\nvan deze software en bijbehorende documentatiebestanden (de \"Software\"), om\nin de Software zonder beperking, inclusief maar niet beperkt tot de rechten\ngebruiken, kopiëren, wijzigen, samenvoegen, publiceren, distribueren, in sublicentie geven en/of verkopen\nkopieën van de Software, en om personen aan wie de Software is\ndaartoe ingericht, onder de volgende voorwaarden:\n\nDe bovenstaande copyrightkennisgeving en deze toestemmingskennisgeving zullen worden opgenomen in alle\nkopieën of substantiële delen van de Software.\n\nDE SOFTWARE WORDT GELEVERD \"AS IS\", ZONDER ENIGE GARANTIE, EXPLICIET OF\nIMPLICIET, INCLUSIEF MAAR NIET BEPERKT TOT DE GARANTIES VAN VERKOOPBAARHEID,\nGESCHIKTHEID VOOR EEN BEPAALD DOEL EN NIET-INBREUK. IN GEEN GEVAL ZAL DE\nAUTEURS OF AUTEURSRECHTHOUDERS ZIJN AANSPRAKELIJK VOOR ENIGE CLAIM, SCHADE OF ANDERE\nAANSPRAKELIJKHEID, ONGEACHT UIT EEN OVEREENKOMST, ONRECHTMATIGHEID OF ANDERSZINS, VOORTVLOEIEND UIT,\nBUITEN OF IN VERBAND MET DE SOFTWARE OF HET GEBRUIK OF ANDERE HANDELINGEN IN DE\nSOFTWARE.",
                "fr": "* Première version\n\n## Licence\nLicence MIT\n\nCopyright (c) 2021 hendrikhoffmann <hhoffmann@web.de>\n\nPermission est accordée, sans frais, à toute personne obtenant une copie\nde ce logiciel et des fichiers de documentation associés (le \"Logiciel\"), pour traiter\ndans le Logiciel sans restriction, y compris, sans limitation, les droits\nutiliser, copier, modifier, fusionner, publier, distribuer, sous-licencier et/ou vendre\ncopies du Logiciel et de permettre aux personnes auxquelles le Logiciel est\nfourni à cet effet, sous réserve des conditions suivantes :\n\nL'avis de droit d'auteur ci-dessus et cet avis d'autorisation doivent être inclus dans tous les\ndes copies ou des parties substantielles du Logiciel.\n\nLE LOGICIEL EST FOURNI « EN L'ÉTAT », SANS GARANTIE D'AUCUNE SORTE, EXPRESSE OU\nIMPLICITE, Y COMPRIS MAIS NON LIMITÉ AUX GARANTIES DE QUALITÉ MARCHANDE,\nAPTITUDE A UN USAGE PARTICULIER ET NON CONTREFAÇON. EN AUCUN CAS, LE\nLES AUTEURS OU TITULAIRES DE DROITS D'AUTEUR SERONT RESPONSABLES DE TOUTE RÉCLAMATION, DOMMAGES OU AUTRE\nRESPONSABILITÉ, QUE CE SOIT DANS UNE ACTION CONTRACTUELLE, DÉLICTUELLE OU AUTRE, DÉCOULANT DE,\nHORS OU EN RELATION AVEC LE LOGICIEL OU L'UTILISATION OU D'AUTRES OPÉRATIONS DANS LE\nLOGICIEL.",
                "it": "* Versione iniziale\n\n## Licenza\nLicenza MIT\n\nCopyright (c) 2021 hendrikhoffmann <hhoffmann@web.de>\n\nL'autorizzazione è concessa, a titolo gratuito, a chiunque ne ottenga una copia\ndi questo software e dei file di documentazione associati (il \"Software\"), per trattare\nnel Software senza restrizioni, inclusi senza limitazione i diritti\nutilizzare, copiare, modificare, unire, pubblicare, distribuire, concedere in sublicenza e/o vendere\ncopie del Software e per consentire alle persone a cui il Software è\narredato a tal fine, alle seguenti condizioni:\n\nL'avviso di copyright di cui sopra e questo avviso di autorizzazione devono essere inclusi in tutto\ncopie o parti sostanziali del Software.\n\nIL SOFTWARE VIENE FORNITO \"COS COM'È\", SENZA GARANZIE DI ALCUN TIPO, ESPRESSE O\nIMPLICITA, COMPRESE MA NON LIMITATE ALLE GARANZIE DI COMMERCIABILITÀ,\nIDONEITÀ PER UNO SCOPO PARTICOLARE E NON VIOLAZIONE. IN NESSUN CASO IL\nGLI AUTORI O I TITOLARI DEL COPYRIGHT SARANNO RESPONSABILI PER QUALSIASI RECLAMO, DANNI O ALTRO\nRESPONSABILITÀ, SIA IN AZIONE CONTRATTUALE, ILLECITO O ALTRO, DERIVANTE DA,\nFUORI O IN CONNESSIONE CON IL SOFTWARE O L'UTILIZZO O ALTRI TRATTAMENTI IN\nSOFTWARE.",
                "es": "* Versión inicial\n\n## Licencia\nLicencia MIT\n\nCopyright (c) 2021 hendrikhoffmann <hhoffmann@web.de>\n\nPor la presente se otorga permiso, sin cargo, a cualquier persona que obtenga una copia.\nde este software y los archivos de documentación asociados (el \"Software\"), para tratar\nen el Software sin restricción, incluidos, entre otros, los derechos\npara usar, copiar, modificar, fusionar, publicar, distribuir, sublicenciar y / o vender\ncopias del Software, y para permitir a las personas a las que el Software es\namueblado para ello, sujeto a las siguientes condiciones:\n\nEl aviso de copyright anterior y este aviso de permiso se incluirán en todos\ncopias o partes sustanciales del Software.\n\nEL SOFTWARE SE PROPORCIONA \"TAL CUAL\", SIN GARANTÍA DE NINGÚN TIPO, EXPRESA O\nIMPLÍCITAS, INCLUIDAS PERO NO LIMITADAS A LAS GARANTÍAS DE COMERCIABILIDAD,\nAPTITUD PARA UN PROPÓSITO PARTICULAR Y NO INFRACCIÓN. EN NINGÚN CASO\nLOS AUTORES O TITULARES DE LOS DERECHOS DE AUTOR SERÁN RESPONSABLES DE CUALQUIER RECLAMO, DAÑOS U OTROS\nRESPONSABILIDAD, YA SEA EN UNA ACCIÓN DE CONTRATO, AGRAVIO O DE OTRO MODO, QUE SURJA DE,\nFUERA O EN RELACIÓN CON EL SOFTWARE O EL USO U OTROS NEGOCIOS EN EL\nSOFTWARE.",
                "pl": "* Pierwsze wydanie\n\n## Licencja\nLicencja MIT\n\nPrawa autorskie (c) 2021 hendrikhoffmann <hhoffmann@web.de>\n\nNiniejszym udziela się nieodpłatnego zezwolenia każdej osobie otrzymującej kopię\ntego oprogramowania i związanych z nim plików dokumentacji („Oprogramowanie”), aby handlować\nw Oprogramowaniu bez ograniczeń, w tym bez ograniczeń praw\nużywać, kopiować, modyfikować, łączyć, publikować, rozpowszechniać, udzielać sublicencji i/lub sprzedawać\nkopie Oprogramowania oraz do zezwolenia osobom, dla których Oprogramowanie jest\nw tym celu, z zastrzeżeniem następujących warunków:\n\nPowyższa informacja o prawach autorskich i niniejsza informacja o pozwoleniu będą zawarte we wszystkich\nkopie lub istotne części Oprogramowania.\n\nOPROGRAMOWANIE JEST DOSTARCZANE „TAK JAK JEST”, BEZ JAKICHKOLWIEK GWARANCJI, WYRAŹNYCH LUB\nDOROZUMIANYCH, W TYM MIĘDZY INNYMI GWARANCJE WARTOŚCI HANDLOWEJ,\nPRZYDATNOŚĆ DO OKREŚLONEGO CELU I NIENARUSZALNOŚCI. W ŻADNYM WYPADKU NIE\nAUTORZY LUB POSIADACZE PRAW AUTORSKICH PONOSZĄ ODPOWIEDZIALNOŚĆ ZA WSZELKIE ROSZCZENIA, SZKODY LUB INNE\nODPOWIEDZIALNOŚĆ UMOWNA, CZYNNA LUB INNA, WYNIKAJĄCA Z,\nNIE ZWIĄZANE Z OPROGRAMOWANIEM LUB KORZYSTANIEM LUB INNYMI CZYNNOŚCIAMI W\nOPROGRAMOWANIE.",
                "zh-cn": "* 初始发行\n\n＃＃ 执照\n麻省理工学院执照\n\n版权所有 (c) 2021 hendrikhoffmann <hhoffmann@web.de>\n\n特此向任何获得副本的人免费授予许可\n本软件和相关文档文件（“软件”），以处理\n在软件中不受限制，包括但不限于权利\n使用、复制、修改、合并、发布、分发、再许可和/或出售\n软件的副本，并允许软件的接收者\n提供这样做，但须符合以下条件：\n\n以上版权声明和本许可声明应包含在所有\n软件的副本或重要部分。\n\n该软件“按原样”提供，不提供任何形式的明示或保证\n暗示，包括但不限于适销性保证，\n适用于特定目的且不侵权。在任何情况下都不得\n作者或版权持有人应对任何索赔、损害或其他\n责任，无论是在合同诉讼、侵权行为或其他方面，由以下原因引起的，\n与本软件或本软件中的使用或其他交易无关或与之相关\n软件。"
            },
            "0.0.1": {
                "en": "initial release",
                "de": "Erstveröffentlichung",
                "ru": "Начальная версия",
                "pt": "lançamento inicial",
                "nl": "Eerste uitgave",
                "fr": "Première version",
                "it": "Versione iniziale",
                "es": "Versión inicial",
                "pl": "Pierwsze wydanie",
                "zh-cn": "首次出版"
            }
        },
        "title": "CloudRain smart garden irrigation",
        "titleLang": {
            "en": "CloudRain smart garden irrigation",
            "de": "CloudRain intelligente Gartenbewässerung",
            "ru": "Интеллектуальное орошение сада CloudRain",
            "pt": "Irrigação de jardim inteligente CloudRain",
            "nl": "CloudRain slimme tuinirrigatie",
            "fr": "Irrigation de jardin intelligente CloudRain",
            "it": "Irrigazione intelligente del giardino CloudRain",
            "es": "Riego inteligente de jardines CloudRain",
            "pl": "Inteligentne nawadnianie ogrodu CloudRain",
            "zh-cn": "CloudRain智能花园灌溉"
        },
        "desc": {
            "en": "This Adapter connects iobroker to the Cloudrain Smart Irrigation System",
            "de": "Dieser Adapter verbindet iobroker mit dem Cloudrain Smart Irrigation System",
            "ru": "Этот адаптер подключает iobroker к системе интеллектуального орошения Cloudrain.",
            "pt": "Este adaptador conecta iobroker ao sistema de irrigação inteligente Cloudrain",
            "nl": "Deze adapter verbindt iobroker met het Cloudrain Smart Irrigation System",
            "fr": "Cet adaptateur connecte iobroker au système d'irrigation intelligent Cloudrain",
            "it": "Questo adattatore collega iobroker al sistema di irrigazione intelligente Cloudrain",
            "es": "Este adaptador conecta iobroker al sistema de riego inteligente Cloudrain",
            "pl": "Ten adapter łączy iobroker z inteligentnym systemem nawadniania Cloudrain",
            "zh-cn": "此适配器将 iobroker 连接到 Cloudrain 智能灌溉系统"
        },
        "authors": [
            "hendrikhoffmann <hhoffmann@web.de>"
        ],
        "keywords": [
            "cloudrain",
            "irrigation",
            "smart",
            "smartgarden"
        ],
        "license": "MIT",
        "platform": "Javascript/Node.js",
        "main": "main.js",
        "icon": "cloudrain.png",
        "enabled": true,
        "extIcon": "https://raw.githubusercontent.com/hendrikhoffmann/ioBroker.cloudrain/main/admin/cloudrain.png",
        "readme": "https://github.com/hendrikhoffmann/ioBroker.cloudrain/blob/main/README.md",
        "loglevel": "info",
        "mode": "daemon",
        "type": "garden",
        "compact": true,
        "connectionType": "cloud",
        "dataSource": "poll",
        "adminUI": {
			"config": "json"
		},
        "dependencies": [
            {
                "js-controller": ">=2.0.0"
            }
        ]
    },
    "native": {
        "Username": "",
        "Password": "",
        "RequestInterval": "60"
    },
    "objects": [],
    "instanceObjects": [
        {
            "_id": "info",
            "type": "channel",
            "common": {
                "name": "Information"
            },
            "native": {}
        },
        {
            "_id": "info.connection",
            "type": "state",
            "common": {
                "role": "indicator.connected",
                "name": "If connected to device or service",
                "type": "boolean",
                "read": true,
                "write": false,
                "def": false
            },
            "native": {}
        }
    ]
}